In [3]:
import pandas as pd
df=pd.read_csv('D:\\Python Projects\\decision tree\\titinic_dt.csv')

In [4]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [5]:
inputs=df.drop(['PassengerId','Name','SibSp','Parch','Ticket'], axis='columns')

In [6]:
inputs.head()

   Survived  Pclass     Sex   Age     Fare Cabin Embarked
0         0       3    male  22.0   7.2500   NaN        S
1         1       1  female  38.0  71.2833   C85        C
2         1       3  female  26.0   7.9250   NaN        S
3         1       1  female  35.0  53.1000  C123        S
4         0       3    male  35.0   8.0500   NaN        S

In [19]:
inputs_n=inputs.copy()

In [35]:
inputs_n["Age"].fillna(inputs["Age"].mean(skipna=True), inplace=True)

In [37]:
#inputs_n.drop('Cabin', axis=1, inplace=True)
#inputs_n.drop('Embarked', axis=1, inplace=True)

In [38]:
inputs_n.isnull().sum()

Survived    0
Pclass      0
Sex         0
Age         0
Fare        0
dtype: int64

In [42]:
#training=pd.get_dummies(inputs_n, columns=["Sex"])
inputs_n.Sex = inputs_n.Sex.map({'male': 1, 'female': 2})

In [43]:
training.head()

   Survived  Pclass   Age     Fare  Sex_female  Sex_male
0         0       3  22.0   7.2500           0         1
1         1       1  38.0  71.2833           1         0
2         1       3  26.0   7.9250           1         0
3         1       1  35.0  53.1000           1         0
4         0       3  35.0   8.0500           0         1

In [44]:
training_data=training.drop('Survived',axis='columns')
target = training.Survived

In [45]:
from sklearn.model_selection import train_test_split
X_train, X_test, y_train, y_test = train_test_split(training_data,target,test_size=0.2)

In [46]:
from sklearn import tree
model=tree.DecisionTreeClassifier()

In [47]:
model.fit(X_train, y_train)

DecisionTreeClassifier()

In [48]:
model.predict(X_test)

array([0, 0, 0, 0, 0, 0, 1, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 1, 0, 0,
       1, 0, 0, 0, 0, 0, 1, 0, 1, 0, 0, 0, 0, 0, 1, 0, 1, 0, 1, 0, 1, 0,
       0, 0, 1, 1, 1, 1, 0, 0, 0, 1, 0, 1, 1, 0, 1, 1, 1, 0, 0, 0, 1, 0,
       0, 1, 1, 0, 0, 1, 1, 1, 0, 0, 0, 1, 1, 0, 0, 1, 0, 1, 0, 0, 0, 0,
       0, 1, 0, 1, 1, 0, 0, 0, 0, 0, 0, 0, 1, 1, 0, 0, 1, 0, 1, 0, 0, 0,
       0, 0, 0, 0, 1, 0, 1, 0, 0, 1, 1, 0, 0, 1, 1, 1, 0, 1, 0, 0, 1, 0,
       1, 0, 1, 1, 0, 1, 0, 1, 0, 0, 0, 0, 0, 1, 0, 1, 0, 1, 1, 1, 0, 0,
       0, 0, 0, 0, 1, 1, 1, 1, 0, 0, 0, 1, 0, 0, 1, 0, 1, 1, 0, 0, 0, 0,
       0, 0, 0], dtype=int64)

In [49]:
model.score(X_test, y_test)

0.8379888268156425